## Eziocon 

A Software Development Kit for doing simple operations using python in built objects.



### Examples : Oracle Data Base

<br>
<br>
**Topics Covered : **

1. How to manipulate your data source to use the SDK effectively 
2. Story line Walkthrough using Sample Data created 
3. Differences between Oracle SDK and MySQL SDK 
4. Different examples to use the following functions :
    5. Insert 
    6. Count
    5. Update
    6. Fetchone
    7. Fetch many

###  Importing the Libraries

In [1]:
#if you are using oracle Database use the following SDK 
from eziocon.oracle.sdk import oracle

<br>
#### Initialising the credentials for Oracle Database

In [2]:
host = 'your database host '
pwd = 'your database password'
username = 'your database username'
port = 'your database port'
sid = 'your Sid'

#### Intialising Object for Oracle

1. use **setConnect** function to pass the credentials. 
2. If the connection is successful to the database the function would set object variable **connect_check** as **True**. 
3. Without the connect_check being set as true the user will not be able to use other functions of the SDK.
4. This function is common for all the SDKs of the databses ( i.e. Oracle and MySQL)

In [3]:
obj = oracle() #creating the object

In [4]:
obj.setConnect(username=username,hostname=host,port=port,password=pwd,sid=sid)

In [5]:
if obj.connect_check :
    print("Database connection tested and working for now\n")
else:
    print("Database cannot be connected \n")

Database connection tested and working for now

#### Let us assume we have the following empty table created in the Database 

<br> 

**Tablename** : Student

1. First_name : String : Varchar 
2. Last_name : String : Varchar 
3. Subject_Code : String : Varchar 
4. Test_1_Score : Number : Numeric 
5. Test_2_Score : Number : Numeric 
6. Test_3_Score : Number : Numeric 
7. CGPA : Float : CGPA

|  First_name | Last_name | Subject_Code |Test_1_Score|Test_2_Score| Test_3_Score | CGPA|
| ------------- |:-------------:| -----: |-----: |-----: |-----: |-----: |
|  |  | |  |  |  |  |

<br>

-----

** Count Operation : **

---

In [6]:
print(obj.count.__doc__)

        Function to get return the count of rows given the condition and the tablename

        Input :
        tablename: String : Table name in DB
        condtion : String : SQL  where clause condition

        Output:
        Count : Integer : Count of the rows for the given condition and  tablename

In [7]:
obj.count(tablename="student")

0

As there was no data , the table is empty we get the count to be 0. <br>


|  First name | Last name | Subject Code |Test_1_Score|Test_2_Score| Test_3_Score | CGPA|
| ------------- |:-------------:| -----: |-----: |-----: |-----: |-----: |
| Steve | Rogers | IT1011| 34 | 34 | 39 | 9.1 |
| Sam | Winchester | IT1004| 32 | 35 | 39 | 9.2 |
| Sam | Winchester | IT1005| 34 | 36 | 39 | 9.5 |
| Sam | Winchester | IT1006| 36 | 37 | 38 | 9.4 |
| Sam | Winchester | IT1007| 38 | 38 | 40 | 9.8 |
| Dean | Winchester | IT1004| 22 | 25 | 28 | 8.2 |
| Dean | Winchester | IT1006| 26 | 27 | 28 | 8.4 |
| Dean | Winchester | IT1007| 28 | 28 | 30 | 8.8 |
| Tony | Stark | IT1006| 40 | 40 | 40 | 10.0 |
| Tony | Stark | IT1007| 40 | 40 | 40 | 10.0 |


-----

** Insert Operation : **

---

1. We have to enter the above records in the database and  populate it.
2. There are two operations : Inserting one record and Inserting bulk records at once 
3. We will insert the record of Stever Rogers which as it has only one record : Insert one operation
4. The rest of the records will be inserted in bulk : Insert many operation

In [43]:
data = [['first_name','last_name','subject_code','test_1_score','test_2_score','test_3_score','cgpa'],
        ['Sam','Winchester','IT1004',32,35,39,9.2],
        ['Sam','Winchester','IT1006',34,36,39,9.5],
        ['Sam','Winchester','IT1006',36,37,38,9.4],
        ['Sam','Winchester','IT1007',38,38,34,9.8],
        ['Dean','Winchester','IT1004',22,25,28,8.2],
        ['Dean','Winchester','IT1006',26,27,28,8.4],
        ['Dean','Winchester','IT1007',28,28,30,8.8],
        ['Tony','Stark','IT1007',40,40,40,10],
        ['Tony','Stark','IT1006',40,40,40,10]
]

steve_record = ['Steve','Rogers','IT1011',34,34,39,9.1]


** Let us look at the docString of the function : **

In [44]:
print(obj.insert.__doc__)

        Function to insert records in the table given the objects and the tablename

        Input :

        tablename : String : Table name of the Database

        objects : List of Dictionaries or dictionary : Format : {sql table column Name :Value}

        Output:

        Boolean :  True in case of successfully objects else Raise Value error

In [45]:
columns = data[0]
print(columns) #iterator of String

['first_name', 'last_name', 'subject_code', 'test_1_score', 'test_2_score', 'test_3_score', 'cgpa']

In [46]:
#parsing steve record into dictionary 
record = {}
for col,value in zip(columns,steve_record):
    record[col] = value

In [47]:
record # inserting using dictionary

{'cgpa': 9.1,
 'first_name': 'Steve',
 'last_name': 'Rogers',
 'subject_code': 'IT1011',
 'test_1_score': 34,
 'test_2_score': 34,
 'test_3_score': 39}

In [48]:
obj.insert(tablename='student',objects=record)

True

<br>
** The record has been inserted sucessfully.** 

1. We will be checking it using the count function. 
2. We will use the where clause condition arugment in the count function to get the number of records inserted

In [49]:
#getting the total number of records in the table 
obj.count(tablename='student')

1

In [50]:
obj.count(tablename='student',condition="first_name = 'Steve' and last_name = 'Rogers'")

1

In [51]:
# if a wrong condition is given , make Steve as stever : the count must be zero 
obj.count(tablename='student',condition="first_name = 'steve' and last_name = 'Rogers'")

0

#### Bulk Insert :

In [52]:
#parsing records as list of dictionaries 
columns = data[0] #getting first row as the column
final_records = []
for val in data[1:]:
    record = {}
    for col,value in zip(columns,val):
        record[col]= value
    final_records.append(record)

In [53]:
len(final_records) # list of dictionaries of 9 records

9

In [54]:
final_records[1:3] #sample view

[{'cgpa': 9.5,
  'first_name': 'Sam',
  'last_name': 'Winchester',
  'subject_code': 'IT1006',
  'test_1_score': 34,
  'test_2_score': 36,
  'test_3_score': 39},
 {'cgpa': 9.4,
  'first_name': 'Sam',
  'last_name': 'Winchester',
  'subject_code': 'IT1006',
  'test_1_score': 36,
  'test_2_score': 37,
  'test_3_score': 38}]

<br>

In [55]:
# performing bulk insert 
obj.insert(tablename="student",objects=final_records)

True

** The records have been inserted successfully.** 

Let's check it by performing a count operation

In [56]:
print(obj.count(tablename='student'))

10



-----

** Fetch Operation : **

---

In [22]:
print(obj.fetchMany.__doc__)

        Function to fetch all the values from a given table with a given condition

        Input :

        columns : iterator of Strings (list or tuple )  : Column names  in the table you want to view
        table name: String : Table name in the DB
        condition : String : SQL  where clause condition
        rows : Integer: Number of rows to be fetched, Default = -1 : Fetch all
        return_type : Integer : 1 for Data Frame and 2 for JSON parsed Dictionary object


        Output: Data frame or Parsed Json (List of Dictionaries)

In [23]:
print(obj.fetchOne.__doc__)

        Function to return the first row of the table and where the condition satisfies

        Input :

        columns : iterator of Strings (list or tuple )  : Column names  in the table you want to view
        table name: String : Table name in the DB
        condition : String : SQL  where clause condition
        return_type : Integer : 1 for Data Frame and 2 for JSON parsed Dictionary object

        Output : Parsed Json (List of Dictionaries) or DataFrame

<br> 
<br> 

** We will do the following manipulations in fetching the data : This will give you a general idea of how to use the SDK for different selection filters ** 


1. Finding  the students  who  have  enrolled a subject 
3. Fetching rows whose last name is like a particular a string 
4. Fetching the list of students who have different students who have cgpa above a given threshold and  given subject 
5. Fetching the list of subjects a student has enrolled given student first name and last name 
6. Fetch any one record given the first name of the student 
7. Fetch the first 3 records given the first name and last name of student

<br> 

#### 1. Finding the students who have enrolled a subject. 

<Br>

In [57]:
def get_student_names(subject_code):
    
    where_clause = "subject_code ='" + subject_code + "'" #processing the query 
    return obj.fetchMany(columns=("first_name","last_name"),tablename="student",condition=where_clause)

In [58]:
get_student_names("IT1004")

  first_name   last_name
0        Sam  Winchester
1       Dean  Winchester

In [59]:
get_student_names("IT1007")

  first_name   last_name
0        Sam  Winchester
1       Dean  Winchester
2       Tony       Stark

<br> 

####  2 . Fetching rows whose last name is like a particular a string

<br>

In [60]:
def get_student_names_Like(sub_string,column_name):
    where_clause = column_name + " like " + "'%"+sub_string+"%'"
    return obj.fetchMany(columns=("first_name","last_name",column_name),tablename="student",condition=where_clause)

In [61]:
get_student_names_Like("er","last_name")

  first_name   last_name   last_name
0      Steve      Rogers      Rogers
1        Sam  Winchester  Winchester
2        Sam  Winchester  Winchester
3        Sam  Winchester  Winchester
4        Sam  Winchester  Winchester
5       Dean  Winchester  Winchester
6       Dean  Winchester  Winchester
7       Dean  Winchester  Winchester

In [62]:
get_student_names_Like("Winch","last_name")

  first_name   last_name   last_name
0        Sam  Winchester  Winchester
1        Sam  Winchester  Winchester
2        Sam  Winchester  Winchester
3        Sam  Winchester  Winchester
4       Dean  Winchester  Winchester
5       Dean  Winchester  Winchester
6       Dean  Winchester  Winchester

In [63]:
get_student_names_Like("ny","First_name")

  first_name last_name First_name
0       Tony     Stark       Tony
1       Tony     Stark       Tony

In [64]:
get_student_names_Like("star","First_name") #notice there is no string in the firstname matching with stark

Empty DataFrame
Columns: [first_name, last_name, First_name]
Index: []

<br> 

#### 3 . Fetching the list of students who have cgpa more than a given cgpa and in given subject

<br>

In [65]:
def get_student(cgpa,subject_code):
    where_clause = "cgpa > " + str(cgpa) + " and subject_code = '" + subject_code + "'"
    return obj.fetchMany(columns=("first_name","last_name"),tablename="student",condition=where_clause)

In [66]:
get_student(8.0,"IT1007")

  first_name   last_name
0        Sam  Winchester
1       Dean  Winchester
2       Tony       Stark

In [67]:
get_student(9.0,"IT1004")

  first_name   last_name
0        Sam  Winchester

<br> 

#### 4. Fetching the list of subjects a student has enrolled given student first name and last name

<br>

In [69]:
def get_subjects (first_name,last_name):
    where_clause = "first_name = '" +first_name+"' and last_name = '" + last_name+"'"
    return obj.fetchMany(columns= ["subject_code"] ,tablename="student",condition=where_clause,return_type=2)

In [70]:
get_subjects("Tony","Stark") #notice the return type = 2 : sends parsed List of Dictionaries

[{'subject_code': 'IT1007'}, {'subject_code': 'IT1006'}]

In [71]:
get_subjects("Sam","Winchester")

[{'subject_code': 'IT1004'},
 {'subject_code': 'IT1006'},
 {'subject_code': 'IT1006'},
 {'subject_code': 'IT1007'}]

In [72]:
get_subjects("Dean","Winchester")

[{'subject_code': 'IT1004'},
 {'subject_code': 'IT1006'},
 {'subject_code': 'IT1007'}]

<br>

#### 5. Fetch any one record given the first name of the student

<br>

In [73]:
columns

['first_name',
 'last_name',
 'subject_code',
 'test_1_score',
 'test_2_score',
 'test_3_score',
 'cgpa']

In [74]:
def get_any_one_record(first_name):
    where_clause = " first_name ='" + first_name + "'"
    return obj.fetchOne(columns=tuple("*"),tablename="student",condition=where_clause)

In [75]:
get_any_one_record("Dean")

,FIRST_NAME,LAST_NAME,SUBJECT_CODE,TEST_1_SCORE,TEST_2_SCORE,TEST_3_SCORE,CGPA
0,Dean,Winchester,IT1004,22,25,28,8.2

In [76]:
get_any_one_record("Steve")

,FIRST_NAME,LAST_NAME,SUBJECT_CODE,TEST_1_SCORE,TEST_2_SCORE,TEST_3_SCORE,CGPA
0,Steve,Rogers,IT1011,34,34,39,9.1

In [77]:
get_any_one_record("Sam")

,FIRST_NAME,LAST_NAME,SUBJECT_CODE,TEST_1_SCORE,TEST_2_SCORE,TEST_3_SCORE,CGPA
0,Sam,Winchester,IT1004,32,35,39,9.2

In [78]:
get_any_one_record("Tony")

,FIRST_NAME,LAST_NAME,SUBJECT_CODE,TEST_1_SCORE,TEST_2_SCORE,TEST_3_SCORE,CGPA
0,Tony,Stark,IT1007,40,40,40,10.0

<br> 
<br>

#### 6. Fetch first 3 records given the First name and Last name of the student 

We will use the rows parameter in FetchMany parameter

In [79]:
def get_records(first_name , last_name):
    where_clause = "first_name = '" +first_name+"' and last_name = '" + last_name+"'"
    return obj.fetchMany(columns= columns ,tablename="student",condition=where_clause,rows=3)

In [80]:
get_records("Sam","Winchester")

,first_name,last_name,subject_code,test_1_score,test_2_score,test_3_score,cgpa
0,Sam,Winchester,IT1004,32,35,39,9.2
1,Sam,Winchester,IT1006,34,36,39,9.5
2,Sam,Winchester,IT1006,36,37,38,9.4

---------

** Update  Operation ** 

----

In [81]:
print(obj.update.__doc__)

        Input :

        table name: String : Tablename of the DB
        updations: Object : Dictionary : Format : {column:value}
        condition: String : Where condition to filter in the Table

        Output:

        returns: True if successful updation is done successfully

<bR>
We will do the following update activities to see the usage of update functions to understand the variants of the SDK. 

1. Make the Dean as dean in the first name 
2. Make Sam Winchester as sam winchester : Lower case updation 
3. Update the of given student by taking the input of provided test scores and a subject code

<br>


#### 1. Make the Dean as dean in the first name ( Lower Case )

In [82]:
updation = {"first_name":"Dean"} # {column : value } format
obj.update(tablename="student",updations=updation,condition=" first_name = 'dean'")

True

In [83]:
get_student_names_Like("ea","first_name")

  first_name   last_name first_name
0       Dean  Winchester       Dean
1       Dean  Winchester       Dean
2       Dean  Winchester       Dean

<br>

#### 2.  Make Sam Winchester as sam winchester : Lower case updation

In [84]:
updation = {"first_name":"Sam","last_name":"Winchester"}
obj.update(tablename="student",updations=updation,condition=" first_name = 'sam'")

True

In [85]:
get_student_names_Like("am","first_name")

  first_name   last_name first_name
0        Sam  Winchester        Sam
1        Sam  Winchester        Sam
2        Sam  Winchester        Sam
3        Sam  Winchester        Sam

<br> 

#### 3.  Update the of given student by taking the input of provided test scores and a subject code

In [86]:
def update_record(updation,first_name,last_name,subject_code):
    sc = subject_code # just to make the below query line smaller
    
    where_clause = "first_name = '" +first_name+"' and last_name = '" + last_name+"' and subject_code='" +sc+ "'"  
    return obj.update(tablename="student",updations=updation,condition=where_clause)

In [87]:
updation = {"test_1_score":35,"test_3_score":40,"cgpa":9.4} #lets say we want to update the following columns

In [88]:
update_record(updation,"Sam","Winchester","IT1004")

True

In [89]:
obj.fetchOne(columns,"student","first_name='Sam' and subject_code = 'IT1004'")

,first_name,last_name,subject_code,test_1_score,test_2_score,test_3_score,cgpa
0,Sam,Winchester,IT1004,35,35,40,9.4

<br> 

** Record Successfully Updated **

<br> 
<br> 



----

## Well That's All for now Folks : Soon will be adding more wrappers and cool stuff

<br> 

## Stay Tuned  !! 

----